CSI API ETABS v1

# cSapModelPropTendon Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cPropTendon PropTendon { get; }

    ReadOnly Property PropTendon As cPropTendon
    	Get

    Dim instance As cSapModel
    Dim value As cPropTendon

    value = instance.PropTendon

    property cPropTendon^ PropTendon {
    	cPropTendon^ get ();
    }

    abstract PropTendon : cPropTendon with get

#### Property Value

Type: cPropTendon

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com